In [2]:
import pandas as pd
import numpy as np
from pandas.api.types import infer_dtype

liste_prenoms_source = pd.read_csv("DS_PRENOMS_data.tmp.csv", sep=";")

C:\Users\PC\AppData\Local\Temp\ipykernel_23408\2599585552.py:5: DtypeWarning: Columns (0,3) have mixed types. Specify dtype option on import or set low_memory=False.
  liste_prenoms_source = pd.read_csv("DS_PRENOMS_data.tmp.csv", sep=";")

# Exploration

In [3]:
# Visualisation des 5 premières et dernières lignes du DataFrame
display(liste_prenoms_source.tail())

# Indique pour chaque colonne s'il y a des valeurs absentes
display(liste_prenoms_source.isna().any())

# Nombre d'éléments avec une valeur incorrecte par colonne
display(liste_prenoms_source.isna().sum())

# Retourne les lignes avec les valeurs absentes pour une colonne donnée
display(liste_prenoms_source[liste_prenoms_source["PRENOM"].isna()])

# Type de chaque colonne
display(liste_prenoms_source.dtypes)

# Valeur unique par colonne
display(liste_prenoms_source["GEO_OBJECT"].unique())
display(liste_prenoms_source["GEO"].unique())

display(liste_prenoms_source[liste_prenoms_source["GEO_OBJECT"] == "REG"])

# Permet de s'assurer toutes les valeurs d'une colonne sont du même type
# plus d'infos : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.api.types.infer_dtype.html#pandas.api.types.infer_dtype
display(infer_dtype(liste_prenoms_source["GEO"]))

          YOB  SEX    PRENOM GEO GEO_OBJECT  TIME_PERIOD OBS_VALUE
4563258  2018    2  EMILIE_2  57        DEP         2023        3,
4563259  2014    2     EMY_2  59        DEP         2023        4,
4563260  2020    2  EMILIE_2  69        DEP         2023        8,
4563261  2019    2     EMY_2  45        DEP         2023        3,
4563262  2015    2  EMILIE_2  56        DEP         2023        3,

YOB            False
SEX            False
PRENOM          True
GEO            False
GEO_OBJECT     False
TIME_PERIOD    False
OBS_VALUE      False
dtype: bool

YOB            0
SEX            0
PRENOM         2
GEO            0
GEO_OBJECT     0
TIME_PERIOD    0
OBS_VALUE      0
dtype: int64

         YOB  SEX PRENOM GEO GEO_OBJECT  TIME_PERIOD OBS_VALUE
869559  XXXX    2    NaN   F     FRANCE         2023       32,
872645  2003    2    NaN   F     FRANCE         2023        3,

YOB            object
SEX             int64
PRENOM         object
GEO            object
GEO_OBJECT     object
TIME_PERIOD     int64
OBS_VALUE      object
dtype: object

array(['DEP', 'FRANCE', 'REG'], dtype=object)

array(['25', '89', '28', '40', '41', '14', '63', '75', '58', '94', '32',
       '73', '76', '26', '57', '87', '33', '38', '56', '86', '03', '37',
       '84', '54', '35', '47', '70', '49', '08', '16', '29', '93', '42',
       '62', '74', '92', '80', '45', '69', '51', '88', '79', '972', '34',
       '02', '71', '95', '17', '78', '31', '01', '65', '83', '85', '59',
       '13', '72', '67', '39', '68', '77', '91', '06', '21', '43', '974',
       '50', '55', '61', '44', '60', 'F', '22', '19', '27', '36', '24',
       '64', '12', '82', '23', '53', '10', '66', '04', '18', '52', '48',
       '90', '05', '11', '09', '15', '30', '81', '971', '07', '46', '973',
       '976', 7, 40, 94, 92, 93, 59, 13, 75, 69, 95, 971, 33, 53, 78, 50,
       49, 86, 62, 24, 37, 46, 72, 3, 89, 52, 12, 60, 84, 54, 41, 28, 34,
       76, 972, 974, 79, 70, 4, 9, 71, 57, 36, 83, 87, 61, 17, 45, 91,
       976, 31, 67, 65, 23, 82, 38, 30, 8, 21, 88, 80, 81, 85, 58, 32, 35,
       56, 18, 14, 44, 25, 29, 66, 39, 22, 77, 2, 26, 42, 19, 64, 16, 63,
       27, 11, 43, 10, 51, 55, 5, 15, 47, 1, 74, 73, 6, 48, 973, 68, 90],
      dtype=object)

          YOB  SEX         PRENOM GEO GEO_OBJECT  TIME_PERIOD OBS_VALUE
15416    1979    2         CARINE  94        REG         2023        9,
23374    1972    2         CARINE  94        REG         2023       16,
23612    1976    2         CARINE  94        REG         2023       11,
23628    1983    2         CARINE  94        REG         2023        7,
23696    1986    2         CARINE  94        REG         2023        4,
...       ...  ...            ...  ..        ...          ...       ...
4559892  2017    2  PRENOMS_RARES  94        REG         2023       75,
4560374  2015    2  PRENOMS_RARES  94        REG         2023       95,
4561157  2016    2  PRENOMS_RARES  94        REG         2023       73,
4561257  2018    2  PRENOMS_RARES  94        REG         2023       79,
4562941  2019    2  PRENOMS_RARES  94        REG         2023       70,

[25432 rows x 7 columns]

'mixed-integer'

Suite à notre phase d'exploration, nous déduisons les points suivants :
- Il y a des prénoms "PRENOMS_RARES" : à supprimer
- Des prénoms manquants : à supprimer
- Des prénoms avec des suffixes : à supprimer dans les prénoms
- La colonne "OBS_VALUE" n'est pas vraiment un entier : à transformer

In [4]:
# Nettoyage
df_clean = liste_prenoms_source.copy()

# On garde toutes les lignes dont la valeur de la colonne "GEO_OBJECT" est différente de "FRANCE"
df_clean = df_clean[df_clean["GEO_OBJECT"] != "FRANCE"]

# Converti en string la colonne "GEO"
df_clean["GEO"] = df_clean["GEO"].astype("str")
# Pour les lignes dont la valeur est "94" pour "GEO" et "REG" pour "GEO_OBJECT", on met la valeur 3A pour la colonne "GEO"
df_clean.loc[(df_clean["GEO"] == "94") & (df_clean["GEO_OBJECT"] == "REG"), 'GEO'] = "3A"

# Retire la virgule dans la colonne "OBS_VALUE" et la transforme en type "int"
df_clean["OBS_VALUE"] = df_clean["OBS_VALUE"].str.replace(',', '')
df_clean["OBS_VALUE"] = df_clean["OBS_VALUE"].astype("int")

# Caste les deux colonnes
df_clean["YOB"] = df_clean["YOB"].astype("int")
df_clean["GEO"] = df_clean["GEO"].astype("str")

# Supprime les lignes avec des valeurs manquantes
df_clean.dropna(inplace=True)

# Retire le motif _nombre de chaque prénom grâce à une regex
df_clean["PRENOM"] = df_clean["PRENOM"].str.replace(r'_\d+', '', regex=True)

# Retire les lignes qui ont la valeur "PRENOMS_RARES" ou "XXXX" dans leur colonne respective
df_clean = df_clean[(df_clean["PRENOM"].str.lower() != "PRENOMS_RARES".lower()) & (df_clean["YOB"] != "XXXX")]

In [42]:
# Contient tous les prénoms uniques du DataFrame et le nombre de prénoms uniques
df_unique = df_clean["PRENOM"].unique()

display(df_unique)
len(df_unique)

array(['CANDICE', 'CANDIDA', 'CANDY', ..., 'ZUBEYDE', 'ZUINA', 'ZOELY'],
      dtype=object)

15089

In [16]:
# Contient 10 000 premières entrées concernant les naissances d'enfants de sexe féminin dans toute la France
top_10000 = df_clean[(df_clean["SEX"] == 2)][:10000]
top_10000.reset_index(inplace=True)
top_10000

      index   YOB  SEX   PRENOM GEO GEO_OBJECT  OBS_VALUE
0         0  2010    2  CANDICE  25        DEP         13
1         1  2018    2  CANDICE  89        DEP          5
2         2  2015    2  CANDICE  28        DEP          3
3         3  2005    2  CANDICE  40        DEP         10
4         4  2010    2  CANDICE  41        DEP          4
...     ...   ...  ...      ...  ..        ...        ...
9995  73798  1949    2   CARMEN  34        DEP          6
9996  73799  1944    2   CARMEN  02        DEP          3
9997  73800  1949    2   CARMEN  27        DEP          5
9998  73801  1951    2   CARMEN  31        DEP         11
9999  73802  1950    2   CARMEN  09        DEP          5

[10000 rows x 7 columns]

In [44]:
# Contient toutes les naissances de l'année de votre naissance dans le département de votre choix
df_prenom = df_clean.copy()
df_prenom[df_prenom["PRENOM"].str.lower() == "thomas"]

          YOB  SEX  PRENOM  GEO GEO_OBJECT  TIME_PERIOD  OBS_VALUE
3349066  1927    1  THOMAS   69        DEP         2023          3
3349067  1912    1  THOMAS   13        DEP         2023          3
3349069  1908    1  THOMAS  972        DEP         2023         14
3349132  1901    1  THOMAS   66        DEP         2023          3
3349134  1916    1  THOMAS   34        DEP         2023          4
...       ...  ...     ...  ...        ...          ...        ...
4452478  1948    2  THOMAS  972        DEP         2023          4
4452545  1941    2  THOMAS  972        DEP         2023          4
4452589  1931    2  THOMAS  971        DEP         2023          3
4452652  1961    2  THOMAS  971        DEP         2023          5
4452680  1951    2  THOMAS  971        DEP         2023          5

[5799 rows x 7 columns]

In [22]:
# Contient toutes les naissances de l'année de votre naissance dans le département de votre choix

dpt_number = "95"
annee = 1990
df_dpt = df_clean[(df_clean['GEO'] == dpt_number) & (df_clean['YOB'] == annee)]

df_dpt.reset_index(inplace=True, drop=True)

df_dpt

      YOB  SEX       PRENOM GEO GEO_OBJECT  TIME_PERIOD  OBS_VALUE
0    1990    2     CAPUCINE  95        DEP         2023          3
1    1990    2       CARINE  95        DEP         2023          3
2    1990    2  CAROLE-ANNE  95        DEP         2023          3
3    1990    2       CAROLE  95        DEP         2023         14
4    1990    2     CAROLINE  95        DEP         2023         63
..    ...  ...          ...  ..        ...          ...        ...
725  1990    2      WASSILA  95        DEP         2023          3
726  1990    2        WENDY  95        DEP         2023         10
727  1990    2      YASMINA  95        DEP         2023          5
728  1990    2      YASMINE  95        DEP         2023          3
729  1990    2       ELODIE  95        DEP         2023          5

[730 rows x 7 columns]

In [12]:
# Contient toutes les naissances de l'année de votre naissance dans la région de votre choix (plusieurs départements) 
data_regions = [{"number":"01","name":"Ain","region":"Auvergne-Rhône-Alpes"},{"number":"02","name":"Aisne","region":"Hauts-de-France"},{"number":"03","name":"Allier","region":"Auvergne-Rhône-Alpes"},{"number":"04","name":"Alpes-de-Haute-Provence","region":"Provence-Alpes-Côte d’Azur"},{"number":"05","name":"Hautes-Alpes","region":"Provence-Alpes-Côte d’Azur"},{"number":"06","name":"Alpes-Maritimes","region":"Provence-Alpes-Côte d’Azur"},{"number":"07","name":"Ardèche","region":"Auvergne-Rhône-Alpes"},{"number":"08","name":"Ardennes","region":"Grand Est"},{"number":"09","name":"Ariège","region":"Occitanie"},{"number":"10","name":"Aube","region":"Grand Est"},{"number":"11","name":"Aude","region":"Occitanie"},{"number":"12","name":"Aveyron","region":"Occitanie"},{"number":"13","name":"Bouches-du-Rhône","region":"Provence-Alpes-Côte d’Azur"},{"number":"14","name":"Calvados","region":"Normandie"},{"number":"15","name":"Cantal","region":"Auvergne-Rhône-Alpes"},{"number":"16","name":"Charente","region":"Nouvelle-Aquitaine"},{"number":"17","name":"Charente-Maritime","region":"Nouvelle-Aquitaine"},{"number":"18","name":"Cher","region":"Centre-Val de Loire"},{"number":"19","name":"Corrèze","region":"Nouvelle-Aquitaine"},{"number":"2A","name":"Corse-du-Sud","region":"Corse"},{"number":"2B","name":"Haute-Corse","region":"Corse"},{"number":"21","name":"Côte-d’Or","region":"Bourgogne-Franche-Comté"},{"number":"22","name":"Côtes-d’Armor","region":"Bretagne"},{"number":"23","name":"Creuse","region":"Nouvelle-Aquitaine"},{"number":"24","name":"Dordogne","region":"Nouvelle-Aquitaine"},{"number":"25","name":"Doubs","region":"Bourgogne-Franche-Comté"},{"number":"26","name":"Drôme","region":"Auvergne-Rhône-Alpes"},{"number":"27","name":"Eure","region":"Normandie"},{"number":"28","name":"Eure-et-Loir","region":"Centre-Val de Loire"},{"number":"29","name":"Finistère","region":"Bretagne"},{"number":"30","name":"Gard","region":"Occitanie"},{"number":"31","name":"Haute-Garonne","region":"Occitanie"},{"number":"32","name":"Gers","region":"Occitanie"},{"number":"33","name":"Gironde","region":"Nouvelle-Aquitaine"},{"number":"34","name":"Hérault","region":"Occitanie"},{"number":"35","name":"Ille-et-Vilaine","region":"Bretagne"},{"number":"36","name":"Indre","region":"Centre-Val de Loire"},{"number":"37","name":"Indre-et-Loire","region":"Centre-Val de Loire"},{"number":"38","name":"Isère","region":"Auvergne-Rhône-Alpes"},{"number":"39","name":"Jura","region":"Bourgogne-Franche-Comté"},{"number":"40","name":"Landes","region":"Nouvelle-Aquitaine"},{"number":"41","name":"Loir-et-Cher","region":"Centre-Val de Loire"},{"number":"42","name":"Loire","region":"Auvergne-Rhône-Alpes"},{"number":"43","name":"Haute-Loire","region":"Auvergne-Rhône-Alpes"},{"number":"44","name":"Loire-Atlantique","region":"Pays de la Loire"},{"number":"45","name":"Loiret","region":"Centre-Val de Loire"},{"number":"46","name":"Lot","region":"Occitanie"},{"number":"47","name":"Lot-et-Garonne","region":"Nouvelle-Aquitaine"},{"number":"48","name":"Lozère","region":"Occitanie"},{"number":"49","name":"Maine-et-Loire","region":"Pays de la Loire"},{"number":"50","name":"Manche","region":"Normandie"},{"number":"51","name":"Marne","region":"Grand Est"},{"number":"52","name":"Haute-Marne","region":"Grand Est"},{"number":"53","name":"Mayenne","region":"Pays de la Loire"},{"number":"54","name":"Meurthe-et-Moselle","region":"Grand Est"},{"number":"55","name":"Meuse","region":"Grand Est"},{"number":"56","name":"Morbihan","region":"Bretagne"},{"number":"57","name":"Moselle","region":"Grand Est"},{"number":"58","name":"Nièvre","region":"Bourgogne-Franche-Comté"},{"number":"59","name":"Nord","region":"Hauts-de-France"},{"number":"60","name":"Oise","region":"Hauts-de-France"},{"number":"61","name":"Orne","region":"Normandie"},{"number":"62","name":"Pas-de-Calais","region":"Hauts-de-France"},{"number":"63","name":"Puy-de-Dôme","region":"Auvergne-Rhône-Alpes"},{"number":"64","name":"Pyrénées-Atlantiques","region":"Nouvelle-Aquitaine"},{"number":"65","name":"Hautes-Pyrénées","region":"Occitanie"},{"number":"66","name":"Pyrénées-Orientales","region":"Occitanie"},{"number":"67","name":"Bas-Rhin","region":"Grand Est"},{"number":"68","name":"Haut-Rhin","region":"Grand Est"},{"number":"69","name":"Rhône","region":"Auvergne-Rhône-Alpes"},{"number":"70","name":"Haute-Saône","region":"Bourgogne-Franche-Comté"},{"number":"71","name":"Saône-et-Loire","region":"Bourgogne-Franche-Comté"},{"number":"72","name":"Sarthe","region":"Pays de la Loire"},{"number":"73","name":"Savoie","region":"Auvergne-Rhône-Alpes"},{"number":"74","name":"Haute-Savoie","region":"Auvergne-Rhône-Alpes"},{"number":"75","name":"Paris","region":"Ile-de-France"},{"number":"76","name":"Seine-Maritime","region":"Normandie"},{"number":"77","name":"Seine-et-Marne","region":"Ile-de-France"},{"number":"78","name":"Yvelines","region":"Ile-de-France"},{"number":"79","name":"Deux-Sèvres","region":"Nouvelle-Aquitaine"},{"number":"80","name":"Somme","region":"Hauts-de-France"},{"number":"81","name":"Tarn","region":"Occitanie"},{"number":"82","name":"Tarn-et-Garonne","region":"Occitanie"},{"number":"83","name":"Var","region":"Provence-Alpes-Côte d’Azur"},{"number":"84","name":"Vaucluse","region":"Provence-Alpes-Côte d’Azur"},{"number":"85","name":"Vendée","region":"Pays de la Loire"},{"number":"86","name":"Vienne","region":"Nouvelle-Aquitaine"},{"number":"87","name":"Haute-Vienne","region":"Nouvelle-Aquitaine"},{"number":"88","name":"Vosges","region":"Grand Est"},{"number":"89","name":"Yonne","region":"Bourgogne-Franche-Comté"},{"number":"90","name":"Territoire de Belfort","region":"Bourgogne-Franche-Comté"},{"number":"91","name":"Essonne","region":"Ile-de-France"},{"number":"92","name":"Hauts-de-Seine","region":"Ile-de-France"},{"number":"93","name":"Seine-Saint-Denis","region":"Ile-de-France"},{"number":"94","name":"Val-de-Marne","region":"Ile-de-France"},{"number":"95","name":"Val-d’Oise","region":"Ile-de-France"},{"number":"971","name":"Guadeloupe","region":"Guadeloupe"},{"number":"972","name":"Martinique","region":"Martinique"},{"number":"973","name":"Guyane","region":"Guyane"},{"number":"974","name":"La Réunion","region":"La Réunion"},{"number":"976","name":"Mayotte","region":"Mayotte"}]

region = "Ile-de-France"
filtered_arr = [p for p in data_regions if p["region"] == region]

df_idf = df_clean.copy()

# Fonction permettant d'associer, à partir de la variable data_regions, une valeur à la nouvelle colonne "REGION"
def get_region(value):
    region_data = [p["region"] for p in data_regions if str(p["number"]) == str(value).strip()]

    if len(region_data) > 0:
        return region_data[0]
    return ""

annee = 1998
df_idf = df_idf[(df_idf["GEO"].isin([p["number"] for p in filtered_arr])) & (df_idf["YOB"] == annee)]
df_idf["REGION"] = df_idf['GEO'].map(get_region)

df_idf.reset_index(inplace=True, drop=True)
display(df_idf)

       YOB  SEX   PRENOM GEO GEO_OBJECT  TIME_PERIOD  OBS_VALUE         REGION
0     1998    2    CANDY  93        DEP         2023          3  Ile-de-France
1     1998    2  CANELLE  78        DEP         2023          3  Ile-de-France
2     1998    2     CARA  75        DEP         2023          3  Ile-de-France
3     1998    2   CARINE  95        DEP         2023          3  Ile-de-France
4     1998    2    CARLA  75        DEP         2023         75  Ile-de-France
...    ...  ...      ...  ..        ...          ...        ...            ...
7921  1998    2      ZOE  93        DEP         2023         16  Ile-de-France
7922  1998    2      ZOE  91        DEP         2023         17  Ile-de-France
7923  1998    2      ZOE  75        DEP         2023        100  Ile-de-France
7924  1998    2   EMILIE  75        DEP         2023          3  Ile-de-France
7925  1998    2   EMILIE  95        DEP         2023          3  Ile-de-France

[7926 rows x 8 columns]

In [24]:
# Contient toutes les naissances de l'année de votre naissance, dix avant et après votre naissance dans toute la France

annee = 2006

# La méthode isin permet de faire un prédicat sur un tableau
df_range_years = df_clean[(df_clean['YOB'].isin([annee - 10, annee, annee + 10]))]

display(df_range_years.sort_values(by=['YOB']))

          YOB  SEX     PRENOM GEO GEO_OBJECT  TIME_PERIOD  OBS_VALUE
2669222  1996    1       MAEL  27        DEP         2023          3
1758259  1996    2      IMANE  68        DEP         2023          7
1758264  1996    2      IMANE  84        DEP         2023          8
2858587  1996    1     MELVIN  62        DEP         2023          7
4189152  1996    2      PAOLA  92        DEP         2023          5
...       ...  ...        ...  ..        ...          ...        ...
2671695  2016    1  MAHAMADOU  95        DEP         2023          4
2671694  2016    1      MAHDI  62        DEP         2023          3
2671689  2016    1      MAHDI  28        DEP         2023          4
2671664  2016    2      LUCIA  92        DEP         2023          8
4563250  2016    2     EMILIE  84        DEP         2023          4

[145222 rows x 7 columns]

# Partie groupement

In [49]:
# Choissiez une année et trouvez le prénom masculin et féminin le plus populaire dans la France entière (Territoire d'Outre-Mer + Metropole). Puis faites de même 10 ans avant et après l'année choisie
annee = 1995
grouped_births_1995 = (
    # On récupére les lignes pour l'année, on groupe par "PRENOM" et "SEX" et on fait une somme sur la colonne "OBS_VALUE"
    df_clean[df_clean["YOB"] == annee].groupby(['PRENOM', "SEX"], as_index=False)["OBS_VALUE"].sum()
)

# On groupe par SEX pour ensuite récupérer la ligne avec la valeur la plus haute pour chaque catégorie
top_births = (grouped_births_1995.groupby(['SEX'], as_index=False).apply(lambda grp: grp.nlargest(1, "OBS_VALUE")))
top_births.reset_index(drop=True, inplace=True)

# On récupére le total des naissances par sexe pour l'année sélectionnée
total_births = df_clean[df_clean["YOB"] == annee].groupby(["SEX"], as_index=False)["OBS_VALUE"].sum()

ratio_top_male_firstname = top_births[(top_births["SEX"] == 1)]["OBS_VALUE"] / total_births[(total_births["SEX"] == 1)]["OBS_VALUE"] * 100
ratio_top_female_firstname = top_births[(top_births["SEX"] == 2)]["OBS_VALUE"] / total_births[(total_births["SEX"] == 2)]["OBS_VALUE"] * 100

# On place le résultat du calcul de proportion de naissance pour le prénom. values[0] retourne la valeur pour la colonne choisie
# à noter que ce n'est pas la même chose que [0], ça ne fonctionnera pas 
top_male_firstname = top_births[(top_births["SEX"] == 1)]["PRENOM"].values[0]
top_female_firstname = top_births[(top_births["SEX"] == 2)]["PRENOM"].values[0]

display(f"Le prénom {top_male_firstname} représente {ratio_top_male_firstname.values[0]}% des naissances de garçons en {annee}")
display(f"Le prénom {top_female_firstname} représente {ratio_top_female_firstname.values[0]}% des naissances de filles en {annee}")

# Pour les autres années, il suffit de copier le code et remplacer la variable "annee"

'Le prénom NICOLAS représente 2.7934088518092626% des naissances de garçons en 1995'

'Le prénom MANON représente 2.7517081238201837% des naissances de filles en 1995'

In [9]:
# Pour un prénom choisi, calculer le nombre de naissances par an pour ce prénom et ordonnez par ordre croissant

firstname = "Marie"
df = df_clean.copy()
df = df[df["SEX"] == 2]

res = (
    df[df["PRENOM"].str.lower() == firstname.lower()].groupby(["YOB", "PRENOM"], as_index=False)["OBS_VALUE"].sum()
)

display(res.sort_values(by=['OBS_VALUE'], ascending=True))

      YOB PRENOM  OBS_VALUE
122  2022  MARIE        496
123  2023  MARIE        565
121  2021  MARIE        592
120  2020  MARIE        616
119  2019  MARIE        721
..    ...    ...        ...
5    1905  MARIE      48981
4    1904  MARIE      50131
3    1903  MARIE      50424
2    1902  MARIE      51857
1    1901  MARIE      52150

[124 rows x 3 columns]

In [ ]:
# Calculez le nombre de prénoms uniques par département toute années confondues

res = df_clean.groupby(["GEO", "SEX"])["PRENOM"].nunique().reset_index()
res["REGION"] = res['GEO'].map(get_region)

display(res)

     GEO  SEX  PRENOM                REGION
0     01    1       5  Auvergne-Rhône-Alpes
1     01    2     142  Auvergne-Rhône-Alpes
2     02    1       4       Hauts-de-France
3     02    2     167       Hauts-de-France
4     03    1       2  Auvergne-Rhône-Alpes
..   ...  ...     ...                   ...
213  973    2    1084                Guyane
214  974    1    1847            La Réunion
215  974    2    2387            La Réunion
216  976    1     725               Mayotte
217  976    2     750               Mayotte

[218 rows x 4 columns]

5359

In [29]:
# Contient tous les prénoms epicenes
df_filter = (
    # On groupe par prénom et sexe
    df_clean
        .groupby(['PRENOM', 'SEX'], as_index=False)["OBS_VALUE"]
        .sum()
)

# On récupére toutes les lignes dont la colonne "PRENOM" est dupliquée
df_epicene = df_filter[df_filter.duplicated('PRENOM', keep=False)]

res_step_1 = df_epicene.groupby(['PRENOM'], as_index=False)['OBS_VALUE'].sum()
display(res_step_1)

# Pour aller plus loin, nous allons calculer la différence d'occurrences entre le prénom masculin et féminin 
# et ainsi voir s'il est plus donné aux filles qu'au garçon

df_epicene_diff = df_epicene.groupby(["PRENOM"])['OBS_VALUE'].apply(lambda x: np.diff(x).item()).reset_index()
df_epicene_diff["OBS_VALUE"] = df_epicene_diff["OBS_VALUE"].abs()

res = df_epicene.merge(df_epicene_diff, left_on='PRENOM', right_on='PRENOM')
res.rename(columns={"OBS_VALUE_x": "OBS_VALUE", "OBS_VALUE_y": "diff"}, inplace=True)

display(res)

# Export csv et json sous forme de tableau d'objets
res.to_csv("epicene.tmp.csv")

res.to_json("epicene.tmp.json", orient="records")

       PRENOM  OBS_VALUE
0       ABDON        463
1        ABEL      22867
2     ACHILLE      13755
3        ACIL          6
4        ADAM      77246
..        ...        ...
890  YVONNICK       1316
891  ZACHARIE       3297
892    ZAYANE         25
893       ZOE      68559
894      ZOLA        320

[895 rows x 2 columns]

       PRENOM  SEX  OBS_VALUE   diff
0       ABDON    1        426    389
1       ABDON    2         37    389
2        ABEL    1      22804  22741
3        ABEL    2         63  22741
4     ACHILLE    1      13679  13603
...       ...  ...        ...    ...
1785   ZAYANE    2          9      7
1786      ZOE    1        122  68315
1787      ZOE    2      68437  68315
1788     ZOLA    1         10    300
1789     ZOLA    2        310    300

[1790 rows x 4 columns]

In [ ]:
# Prénoms féminins épicènes
hypo = df_clean.copy()
hypo = df_clean[df_clean["SEX"] == 2].groupby(["PRENOM"], as_index=False)["OBS_VALUE"].sum()
hypo = hypo[hypo["PRENOM"].str.endswith("INE")]

display(hypo)